function clickButton()
{
	var a = prompt("1.Ваше число больше или меньше чем 50?");
	if (a=="больше") {
			var a = prompt("2.Ваше число больше или меньше чем 75?");
			if (a=="больше") {
					var a = prompt("3.Ваше число больше или меньше чем 85?");
					if (a=="больше") {
							var a = prompt("4.Ваше число больше или меньше чем 93?");
							if (a=="больше") {
									var a = prompt("5.Ваше число больше или меньше чем 98?");
									if (a=="больше") {
											var a = prompt("6.Ваше число больше или меньше чем 99?");
											if (a=="больше") {
												var a = prompt("1.Ваше число больше или меньше чем 100?"); //завершено
											}
											else {}
									}
									else if (a=="меньше") {
											var a = prompt("5.Ваше число больше или меньше чем 96?");
											if (a=="больше") {
												var a = prompt("6.Ваше число больше или меньше чем 97?"); //завершено
											}
											else if (a=="меньше") {
												var a = prompt("6.Ваше число больше или меньше 65?")
											}
											else {}
									}
									else {}
							}
							else if (a=="меньше") {}
							else {}
					}
					else if (a=="меньше") {}
					else {}
			}
			else if (a=="меньше") {}
			else {}
	}
	else if (a=="меньше") {
			var a = prompt("2.Ваше число больше или меньше чем 25?");
			if (a=="больше") {}
			else if (a=="меньше") {
					var a = prompt("3.Ваше число больше или меньше чем 13?");
					if (a=="больше") {}
					else if (a=="меньше") {	
						var a = prompt("4.Ваше число больше или меньше чем 7?");
						if (a=="больше") {}
						else if (a=="меньше") {
								var a = prompt("5.Ваше число больше или меньше чем 4?");
								if (a=="больше") {}
								else if (a=="меньше") {
										var a = prompt("6.Ваше число больше или меньше чем 2?");
										if (a=="больше") {}
										else if (a=="меньше") {
												var a = prompt("1.Ваше число больше или меньше чем 50?"); //завершено
												if (a=="больше") {}
												else if (a=="меньше") {}
												else {}
										}
										else {}
								}
								else {}
						}
						else {}
					}
					else {}
			}
			else {}
	}
	else {}